[
  {  
    "id": 2,
    "title": "Diseñado para rediseñar",
    "content": "<p class='center' align='justify'>Desde el día en que me puse a pensar, escribir mi vida o dejar que ella me escriba a mi. Duré horas sentado en mi escritorio frente a mi computadora imaginándome multitudes de cosas y llegar a pensar que hay puntos donde las personas suelen limitar las cosas. pero también llegar al punto donde tomas la decisión de no limitarte, siempre pienso profundamente en las cosas y quisiera que todos hagan lo mismo.</p><p align='justify'>Siempre aprendiendo de la gente y trabajando por mis ideas aplicando grandes grietas buenas de humildad. No me gusta excluir a la gente, llevando la idea de ser siempre amigo de todos sin importar su nivel de conocimiento, pero llegar a pensar de que hay personas con demasiados conocimientos para cambiar y compartir demasiadas cosas en este mundo. Prefieren vivir en un mar de egocentrismo, pero recordar de que todos tuvimos el mismo proceso de nacimiento dependiendo de ciertas multitudes de condiciones, aunque no hay personas de bronce, plata y oro pero si hay personas realmente brillantes.</p><p align='justify'>Desperdiciar nuestros conocimientos actuando indebidamente, grave error. debemos cambiar esto no tratar de dañar y dejarlo así, sino tratar de dañar y transformar las partes defectuosas que impiden avanzar.</p><p align='justify'>Es completamente claro, a este mundo llegan diferentes tipos de personas con millones de actividades para aplicar. Personas con nuevos ideales para imponer, emprender, proyectar, crear y para visionar el futuro generando nuevas y grandes tendencias en el avance.</p><p align='justify'>Quisiera hacer del mundo un lugar mejor, pero pensándolo bien. ¿Quieres cambiar el mundo o que el te cambie a ti?, o dejar que otras personas pongan letras en tu escritura que no deben estar, letras las cuales matarian y exterminarian a las tuyas. la clave está en hacer realidad tus ideas y no dejar pasar el tiempo, y después llegar a decir con tus palabras de que no pudiste hacerlas. *out* es totalmente falso, porque llegas a pensar de que no puedes hacer tus ideas y limitas tu habilidad, llegando al punto de sentirte como un vaso de agua totalmente vacío.</p><p align='justify'>Aprovecha el tiempo o trata de pensar de que el tiempo no va contigo, para no retroceder o quedarte estancado y hacer realidad tus ideas.</p><p align='justify'>La humildad, es la verdadera clave para el buen proceso de obtención de conocimiento.</p><p>- Jose Pino (Fraph)</p><a href='https://medium.com/@jofpin/disenado-para-redisenar-8f9e69b1d467'>Diseñado para rediseñar - Medium</a>",
    "date": "17-10-2014"
  }
]
