[
  {  
    "id": 3,
    "title": "Clicking ACPR en Twitter",
    "content": "<p class='center' align='justify'>Que es ACPR?</p><p align='justify'>Aggressive Caching of POST Requests(ACPR)</p><p align='justify'>Almacenamiento agresivo del cache mediante las peticiones POST, poniendo como base el uso de peticiones POST + AJAX. Tienden a comunicarse agresivamente en cache, en ausencia de las cabeceras control cache. Encontra del comportamiento exhibido por la mayoría de los agentes de usuario (UserAgents).</p><p align='justify'>El dia 27 de septiembre estaba buscando vulnerabilidades en Twitter, para guardarlas y reportarlas el año entrante y ser listado en el hof 2015, mediante el proceso de investigación encontré algunos bugs en un servicio de terceros de Twitter llamado <a href='http://www.mopub.com/'>MoPub</a>, lo cual los bugs reportados de este servicio son totalmente validados.</p><p align='justify'>Pero después de 2 horas de investigación, encontré algo muy curioso en twitter, lo cual al darle click varias veces en “seguir” a la cuenta de un usuario repetidamente, el contador de seguidores se altera mostrando mas seguidores de los cuales no existen. En el proceso no solo puedes aumentar, también puedes disminuir.</p><p align='justify'>Mediante todo este proceso llegue a la conclusión de este calculo: Clicks * speed + 20seconds = (Followers + or -)</p><p align='justify'>Al transcurrir los 20 segundos, tendrías que dar clicks a gran velocidad para obtener buenos resultados en el proceso de aumento de valores en el contador de seguidores, después de los 20 segundos los resultados decaerán, y los valores del contador van a disminuir con una probabilidad aproximada de un 20% dependiendo la velocidad de los clicks y dependiendo del total de seguidores reales de la cuenta de usuario.</p><p align='justify'>Lo cual esto me lleva a afirmar que los valores de aumento agregados en el contador, pueden volver a su estado normal en este caso.</p><p align='justify'>Ejemplo: en esta imagen > <a href='http://imgur.com/tvIOjTR'>Preview</a> podemos ver que el total de seguidores de la cuenta <strong>@f403mx</strong> son 4, como valor normal sin ninguna alteración y podemos comprobar viendo el total de personas que siguen esta cuenta. Pero en esta imagen <a href='http://imgur.com/aqCKSbf'>Preview</a> podemos ver el contador alterado, con un total de 17 seguidores, lo cual 5 son reales y fueron 12 valores aumentados al contador mediante el proceso.</p><p>Calculo Visual.</p><p align='justify'>Hay un valor máximo que logre obtener por cuenta, con una sola cuenta de usuario puedes agregar aproximadamente 23 seguidores, dependiendo los cálculos que hagas con tu vista, no recomiendo un Auto-click, porque el calculo no seria igual lo cual tu mismo tienes que ver el resultado que quieres llegar a obtener.</p><p align='justify'>Supongamos tienes 4 cuentas de usuario, mas la cuenta de usuario que quieres agregarle los valores al contador.</p><p align='justify'>Estas 4 cuentas dan una suma de 92 valores hacia el contador, como puede haber un reinicio del contador inmediato tienes que medir bien la velocidad de tus clicks.</p><p>Solo en Followers?</p><p align='justify'>Después de sacar todo el proceso anterior, me llevo a probar con el resto de contadores, principalmente el contador de “TWEETS”. Fue realmente efectivo y lo diferente, es que en este caso son totalmente permanentes.</p><p align='justify'>Publique 10 tweets con <strong>@cattimer</strong>, tenia que eliminar los tweets para formar un proceso brusco de la comunicación del AJAX + POST, busque en internet alguna herramienta que se conecte a twitter y poder eliminar todos los tweets automáticamente, esto generaría un proceso brusco, y realmente así lo fue, después de 2 intentos quedaron estancados 2 “tweets”, lo cual no existe ningún retroceso o disminución, solo existen posibles aumentos en este caso.</p><p align='justify'>Pueden observar el contador de “tweets” de la cuenta de usuario puesta a prueba. <strong>@cattimer</strong> el gran problema es que los valores de los contadores se globalizan y no solo tu lo puedes ver, sino todos en Internet.</p><p align='justify'>En diciembre del año pasado 2013, logre encontrar un Global spoofing en twitter.</p><p align='justify'>Date: <strong>12/12/2013</strong></p><p align='justify'>Lo cual me permitía suplantar la identidad de las Twitter Cards de los usuarios en todo twitter, este fallo lo informe a twitter y fue reparado de inmediato. pero anteriormente había descubierto una posible reparación permanente para las cuentas que utilice para hacer toda mi investigación. Lo cual todas estas cuentas tuvieron un “Fix” exitoso, una de esas cuentas fue <strong>@bugcrowd</strong>, lamentablemente el Fix no funciono 100% con este servicio, en este caso quedo almacenada mi cuenta de usuario en la visualización de las twitter tarjetas de <a href='https://bugcrowd.com/'>bugcrowd.com</a> en twitter. ver imagen: <a href='http://imgur.com/7ypIP93'>Preview</a></p><p align='justify'>ACPR no solo en Twitter, platicando con un amigo acerca de esto, me mando esta foto. de una cuenta en instagram: <a href='http://imgur.com/hJWUHxP'>Preview</a></p><p align='justify'>Posiblemente te encuentres, o te has encontrado con cosas como estas en Internet. esta fue mi producción con twitter espero que les haya gustado.</p><p align='justify'>No importa el tipo de vulnerabilidad, lo único que importa es la creatividad que le pongas y las cosas que puedas alcanzar con ella!</p><p align='justify'>Este error no ha sido informado a twitter, por no tener una gravedad muy alta.</p><p>- Jose Pino</p><a href='https://medium.com/@jofpin/clicking-acpr-en-twitter-99181283f204'>Clicking ACPR en Twitter - Medium</a>",
    "date": "29-10-2014"
  }
]
