[
  {  
    "id": 4,
    "title": "Esto no paso ayer, tu sabes cuando paso!",
    "content": "<p align='justify'>Ayer me levante, e inicie a trabajar en una nueva empresa de social media y seo posicionamiento. Publicaba los contenidos en cada sitio, con la suprema ansiedad de esperar los 2 primeros pagos para comprar una laptop, era marzo del 2o13. Pasaron los días y llegaron los 2 momentos de pago, pero esperaba un tercer pago y no lo recibí, al cobrar el dueño de la empresa me ignoro y no respondió a mis mensajes de cobro.</p><p align='justify'><strong>Caso tirado al barranco</strong>, no insistí mas y seguí mi camino. Quede totalmente independiente en esos momentos pero aprendí muchas cosas dentro de esa empresa. Pero realmente pensé en que esto no debía quedar así, no me pagaron y me ignoraron tenia algo de inquietud en mis pensamientos de la forma injusta como me trataron, y que debía hacer algo para quedar tranquilo de esto.</p><p align='justify'>Paso un año ya era marzo del 2014. Compartía un poco con uno de los empleados de aquella empresa su nombre es <strong>Johan Torcid</strong>, el 23 de marzo Mega y paypal me pagaron por reportar algunos fallos de seguridad. Johan se entero y me pidió prestado algunos dolares, confiadamente lo hice pero poniéndole un tiempo estimado de pago fijo.</p><p align='justify'> Llego el día, el cual Johan me pagaría el dinero. Me sentía contento, porque no tenia ni un dolar en mi bolsillo. Pero es triste recordar, Johan dijo “Frank aun no me han pagado este mes, cuando pase este mes te pago por favor”, confiadamente espere el siguiente mes pero ya era mayo, volví y hable con Johan el vuelve y me repite que aun no le habían pagado lo cual me responde de una manera injusta. Desde ese momento Johan ya no era mi amigo, comenzaría a tratarlo solo por hipocresía, pasaron los meses ya era agosto y mi “amigo” Johan aun no me había pagado.</p><p align='justify'> Decidí, desquitarme de alguna manera ya que “No importa la cantidad de dinero en un negocio, lo que importa es la palabra y seriedad puntual de aquella persona, para que todo sea efectivo y no se genere ningún tipo de conflicto”</p><h3 class='center' align='justify'>Llega el momento de ataque!</h3><p align='justify'>Trataba mucho con un amigo llamado maximiliano, era 29 de agosto del 2014 ese día le hice ingeniera social a uno de los nuevos empleados de aquella empresa donde Johan estaba recientemente trabajando, según Johan también se encargaba de la seguridad de la empresa. Mediante el proceso de persuasion a uno de los empleados para obtener cierta información, este me comparte un usuario y una contraseña de un sitio, anteriormente habia tratado con este empleado pero con otra identidad. Entro con los accesos que me dio este personaje y mediante un Symlink se listaron muchos sitios especialmente el de la empresa que no me había pagado mi dinero ☺, pero en ese servidor no se encontraba el sitio del señor Johan, el cual era el objetivo para desquitarme ya que este no me pago el dinero, aunque ya no importaba el dinero si no la in-seriedad y la falta de palabra.</p><p align='justify'>Fue un desastre, me pude desquitar de aquella empresa que no me pago mi dinero el dia 30 de agosto a las 3 A.M, pero faltaba Johan el cual su sitio estaba alojado en otro servidor. Mediante esto. con maximiliano buscamos sitios con la misma IP, para poder acceder. Minutos mas tarde logre un acceso, Este servidor también era vulnerable a symlink, por lo tanto logramos ver el sitio de Johan.</p><p align='justify'>Se genera un Team, para despistar y el sitio de Johan fue atacado aunque minutos mas tarde. Este niega la acción afirmando que su sitio es super “seguro” y nadie podría penetrar su “seguridad”, esto genero mucha risa en maximiliano y en mi, pero mediante todo esto desde ahí, comencé a hacerle Ingeniería social a Johan con el objetivo de volverlo a atacar los pasos eran. Simular que era su amigo y que nada había pasado, para así mismo ganar un poco su confianza y este me compartiera ciertos datos que me permitieran acceso a su servidor.</p><p align='justify'>El 15 de noviembre, tuve una conversación con Johan. La cual me hablo de negocios de que una empresa necesitaba un desarrollador, confiado viaje a la capital de mi país donde estaría aquella empresa y la reunión seria el día 19. Llegue el día 18 a la capital. Ya era 21 de noviembre y aun no había llegado ninguna reunión.</p><p align='justify'>El dia 22 de noviembre a las 4: 27 PM se ejerce la reunión, pero note algo. La relación de la reunion no era el mismo nombre de la empresa el cual el me hablo dias antes en la conversación, y antes de comenzar mi presentación ante la presidente de una empresa diferente de la que el me habia mencionado, la organizadora dice que diga que soy miembro de la empresa que no me pago el año pasado 2013, Respondi. “Claro no hay ningun problema”, respire profundo y al terminar mi presentación la presidenta de la empresa me felicito. Pense de que todo esto no era lo que el señor Johan, me habia hablado anteriormente.</p><p align='justify'>Recordé algo. “Si te faltan una vez, es posible que vuelva a suceder con personas que les hace falta la palabra”, antes de viajar sentia de que algo asi pasaria, pero tenia atras y en pie mi objetivo.</p><p align='justify'>Pasaron los días, y nunca se arranco un trabajo con aquella empresa. Lo cual perdí tiempo y dinero en ese viaje. Aunque ya tenia lo que necesitaba los datos de acceso a su servidor, para completar el objetivo. Solo esperaba un día de esos que recuerdas aquellas cosas malas que alguna persona te ha hecho.</p><h3>De regreso!</h3><p align='justify'>El día 23 de noviembre, camine a cobrar un dinero en el centro comercial mas cercano del apartamento para poderme regresar a mi ciudad, minutos antes Johan me llama al teléfono. Pidiéndome prestado algo de dinero, con palabra firme le negué el préstamo. Ya no seria posible prestarle algo con todo el historial de falsedad por encima.</p><p align='justify'>A las 10: 23 AM, salí de la capital en bus y llegue a las 4: 35 PM a mi ciudad. Los días seguían normales, pero en mis recuerdos vivía todo lo que había pasado, mis padres me preguntaban de como me fue en la capital. Para esquivar todo lo que había pasado les dije que todo había salido “Bien”.</p><p align='justify'>Ya no importaba el dinero que me debía, si no la suma de todo lo que paso. ¿Como es posible que, una persona con este tipo de actitudes sea tu amigo? — como es cierto que le quedas mal a tu “amigo”, y a tu novia la engañas e incluyendo que crees en un “Dios”. Y como es posible de que alguien que habla de humildad no la aplica?. No es posible relacionarse con un tipo de personas como Johan.</p><p align='justify'>Acepto, todos en nuestra vida cometemos errores, pero esto ya no es un error esto es algo por defecto de una persona.</p><p align='justify'>Días anteriores, le hice un favor a Johan en CSS, y yo necesitaba comprar un dominio para lanzar un proyecto para retos de eventos de seguridad informática. Johan me compro el dominio, con su cuenta. El 29 de noviembre se realizo un evento de seguridad, lo cual ese día fue lanzado el proyecto, fue un éxito Google analytics registraba mas de 247 personas jugando.</p><h3>Vuelvo al juego!</h3><p align='justify'>El día 30 de noviembre, se me vinieron malos recuerdos acerca de todo lo que había pasado con Johan anteriormente. Especialmente aunque ya había completado mi objetivo de obtención de sus datos. Decidí entrar a su servidor con maximiliano y se surgió un ataque a su sitio. Al día siguiente Johan suspendió el dominio que el había comprado para mi proyecto! ☺</p><p align='justify'>Con anterioridad, había publicado en algunos medios sociales de que mi laptop, se había extraviado después del evento de seguridad informática para despistar. y hacerle saber a Johan de que era imposible haber entrado a su servidor sin PC, aunque era simple reconocer de que había sido. Al fin y al cabo paso.</p><p align='justify'>El alguna vez dijo: “Mi sitio web es super “seguro”, nadie puede vulnerarlo”. pero recuerdo algo que surgió de mi mente.</p><p align='justify'>“El sitio web o la estructura pudo haber sido “segura”, pero tu como persona no lo fuiste”</p><p align='justify'></p>Mi nombre es Jose Pino (Fraph), y esto fue algo que paso en mi vida real. Y lo he decidido compartir! <p>Saludos!</p> <p>- Jose Pino (Fraph)</p><a href='https://medium.com/@jofpin/esto-no-paso-ayer-tu-sabes-cuando-paso-9ef492c56536'>Esto no paso ayer, tu sabes cuando paso! - Medium</a>",
    "date": "02-12-2014"
  }
]
